
*** Dumping AST Record Layout
         0 | class Base
         0 |   int x
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | class A
         0 |   (A vtable pointer)
         8 |   int a
        12 |   class Base (virtual base)
        12 |     int x
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=12, nvalign=8]

*** Dumping AST Record Layout
         0 | class B
         0 |   class Base (base)
         0 |     int x
         4 |   int b
           | [sizeof=8, dsize=8, align=4,
           |  nvsize=8, nvalign=4]

*** Dumping AST Record Layout
         0 | class D
         0 |   (D vtable pointer)
         8 |   int d
        12 |   class B (virtual base)
        12 |     class Base (base)
        12 |       int x
        16 |     int b
           | [sizeof=24, dsize=20, align=8,
           |  nvsize=12, nvalign=8]

*** Dumping AST Record Layout
         0 | class E
         0 |   (E vtable pointer)
         8 |   int e
        12 |   class Base (virtual base)
        12 |     int x
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=12, nvalign=8]

*** Dumping AST Record Layout
         0 | class F
         0 |   (F vtable pointer)
         8 |   int f
        28 |   class Base (virtual base)
        28 |     int x
        16 |   class E (virtual base)
        16 |     (E vtable pointer)
        24 |     int e
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=12, nvalign=8]

*** Dumping AST Record Layout
         0 | class G
         0 |   (G vtable pointer)
         8 |   int g
        12 |   class Base (virtual base)
        12 |     int x
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=12, nvalign=8]

*** Dumping AST Record Layout
         0 | class H
         0 |   class G (primary base)
         0 |     (G vtable pointer)
         8 |     int g
        12 |   int h
        16 |   class Base (virtual base)
        16 |     int x
           | [sizeof=24, dsize=20, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class C
         0 |   class A (primary base)
         0 |     (A vtable pointer)
         8 |     int a
        16 |   class F (base)
        16 |     (F vtable pointer)
        24 |     int f
        28 |   int c
        32 |   class Base (virtual base)
        32 |     int x
        52 |   class B (virtual base)
        52 |     class Base (base)
        52 |       int x
        56 |     int b
        40 |   class D (virtual base)
        40 |     (D vtable pointer)
        48 |     int d
        64 |   class E (virtual base)
        64 |     (E vtable pointer)
        72 |     int e
        80 |   class H (virtual base)
        80 |     class G (primary base)
        80 |       (G vtable pointer)
        88 |       int g
        92 |     int h
           | [sizeof=96, dsize=96, align=8,
           |  nvsize=32, nvalign=8]

*** Dumping IRgen Record Layout
Record: [0;1;32mCXXRecordDecl[0m[0;33m 0x1105ce0[0m <[0;33mtest7.cpp:1:1[0m, [0;33mline:3:1[0m> [0;33mline:1:7[0m referenced class[0;1;36m Base[0m definition
[0;34m|-[0m[0;1;32mDefinitionData[0m pass_in_registers aggregate standard_layout trivially_copyable literal has_constexpr_non_copy_move_ctor can_const_default_init
[0;34m| |-[0m[0;1;32mDefaultConstructor[0m exists non_trivial constexpr defaulted_is_constexpr
[0;34m| |-[0m[0;1;32mCopyConstructor[0m simple trivial has_const_param implicit_has_const_param
[0;34m| |-[0m[0;1;32mMoveConstructor[0m exists simple trivial
[0;34m| |-[0m[0;1;32mCopyAssignment[0m trivial has_const_param implicit_has_const_param
[0;34m| |-[0m[0;1;32mMoveAssignment[0m exists simple trivial
[0;34m| `-[0m[0;1;32mDestructor[0m simple irrelevant trivial
